In [1]:
import pandas as pd

In [2]:
data = {"name":['a','b','c','d','a','c'], "age":['2','4','8','15','2','11'],"size":['s','l','m','xl','s','m']}
df = pd.DataFrame(data)
df

  name age size
0    a   2    s
1    b   4    l
2    c   8    m
3    d  15   xl
4    a   2    s
5    c  11    m

In [4]:
df.duplicated()

0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [14]:
df["dupicated"] = df.duplicated()
df                                 #To identify duplicate

  name age size  dupicated
0    a   2    s      False
1    b   4    l      False
2    c   8    m      False
3    d  15   xl      False
4    a   2    s      False
5    c  11    m      False

In [16]:
df.drop_duplicates(keep='first',inplace=True) 
df
#Keep first use for keeping first data from duplicates , inplace = true use for make change in orignial data

  name age size  dupicated
0    a   2    s      False
1    b   4    l      False
2    c   8    m      False
3    d  15   xl      False
5    c  11    m      False